[
  {
    "title": "1984",
    "summary": "Winston Smith lives under an omnipresent totalitarian regime that surveils citizens through telescreens and continually rewrites the past to fit the Party’s shifting narrative. By day he alters newspaper archives at the Ministry of Truth; by night he clings to stray memories and the belief that facts should not bend to slogans.\n\nA secret affair with Julia gives him a small refuge where honesty and desire can surface, even as Newspeak compresses language and doublethink corrodes meaning. Drawn to the enigmatic O’Brien, Winston hopes for resistance but descends into the machinery of power, where interrogation aims not only to punish bodies but to colonize minds.\n\nThe novel tracks Winston’s attempted rebellion, capture, and breaking, showing how fear, isolation, and linguistic control can unmake the self. It is a study of propaganda, the erasure of history, and the terrifying prospect that a government can dictate reality itself."
  },
  {
    "title": "The Hobbit",
    "summary": "Bilbo Baggins is a home-loving hobbit pulled into an expedition with thirteen dwarves and the wizard Gandalf to reclaim the Lonely Mountain and its treasure from the dragon Smaug. On a road through troll-haunts, goblin tunnels, and the forest of Mirkwood, he finds wit and nerve he did not know he had.\n\nA riddle-game with Gollum yields a peculiar ring that turns invisible its wearer, changing Bilbo’s fortunes and hinting at darker mysteries. Tensions rise as Thorin’s pride collides with the claims of elves and men, and Smaug’s rage threatens Lake-town.\n\nWhen rival hosts gather over the hoard, Bilbo chooses peace and loyalty over gold. He returns to the Shire wiser, having learned that courage and mercy weigh more than treasure."
  },
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "summary": "On his eleventh birthday, Harry learns he is a wizard and leaves a neglected life with the Dursleys for Hogwarts School of Witchcraft and Wizardry. Sorted into Gryffindor, he makes fast friends with Ron and Hermione, discovers a talent for Quidditch, and navigates classes in charms, potions, and transfiguration.\n\nWhispers point to a guarded object—the Philosopher’s Stone—while a three-headed dog and a forbidden corridor signal real danger. Clues lead the trio through hidden keys, a giant chessboard, and a mirror that shows deepest desire.\n\nIn the climax, Harry must rely on ingenuity, friendship, and moral courage to face a foe tied to his past. The story sets a tone where love and choice matter as much as magic."
  },
  {
    "title": "Pride and Prejudice",
    "summary": "Elizabeth Bennet’s quick wit meets the strict conventions of Regency society as her family navigates the marriage market. A proud slight from the wealthy Mr. Darcy confirms her worst judgments about privilege, while Mr. Wickham’s charm seems to explain Darcy’s coldness.\n\nThrough balls, visits, and letters, Elizabeth’s certainty begins to crack. Darcy’s frank letter and quiet acts of discretion reveal a different man than gossip suggested, just as Lydia’s scandal threatens the Bennets’ reputation.\n\nThe novel follows proposals refused and accepted, a visit to Pemberley, and a gradual re-evaluation of character. It argues that self-knowledge and respect are the foundation of enduring love."
  },
  {
    "title": "To Kill a Mockingbird",
    "summary": "Scout Finch grows up in the segregated town of Maycomb, Alabama, where summer games with her brother Jem and friend Dill stand beside lessons in justice and empathy. Her father, Atticus, defends Tom Robinson, a Black man falsely accused of assault, exposing prejudices that shape the community.\n\nThe children witness quiet courage—an unarmed vigil at a jailhouse, measured words in a hostile courtroom, dignity maintained in defeat. Meanwhile, the mystery of the reclusive Boo Radley shifts from fear to compassion as rumor gives way to understanding.\n\nBalancing warmth and humor with moral seriousness, the story asks what it takes to raise children who resist cruelty and recognize shared humanity. It is a coming-of-age tale about conscience, kindness, and the cost of doing what is right."
  },
  {
    "title": "The Great Gatsby",
    "summary": "Nick Carraway rents a modest house in West Egg and becomes neighbor to Jay Gatsby, a dazzling host whose parties draw the era’s elite. Behind the spectacle lies a single hope: to reclaim a past romance with Daisy Buchanan, whose marriage to the entitled Tom masks carelessness and unrest.\n\nFast cars, secret apartments, and glittering façades can’t hide a growing moral drift. A deadly accident and its aftermath strip away the illusions that money and polish can sustain.\n\nThe green light across the bay becomes a symbol of the distance between longing and reality. The novel interrogates class, desire, and the American Dream, asking whether reinvention can survive indifference and privilege."
  },
  {
    "title": "Moby-Dick",
    "summary": "Ishmael signs onto the whaling ship Pequod seeking seafaring work and a cure for restless melancholy, only to find Captain Ahab fixed on revenge against the white whale that maimed him. The voyage becomes a survey of the world—cosmopolitan crews, the craft of whaling, sermons and storms—while Ahab’s will bends ship and sailors toward a single end.\n\nStarbuck, the conscientious first mate, questions a mission that courts ruin, yet duty and charisma keep the crew bound. Omens accumulate as horizons narrow and the hunt overtakes caution.\n\nPart adventure and part meditation, the novel asks what knowledge is possible and what price men pay for obsession. The final chase pits human intent against an immense, indifferent sea."
  },
  {
    "title": "War and Peace",
    "summary": "Tolstoy follows the Rostovs, Bolkonskys, and Bezukhovs across salons and battlefields as Napoleon’s campaigns sweep through Russia. Pierre searches for moral purpose, Andrei wrestles with ambition and disillusion, and Natasha’s exuberance collides with loss.\n\nScenes of dinners, duels, and letters stand beside sweeping depictions of strategy and the chaos of combat, suggesting that history springs not only from great men but from countless small decisions. Moscow burns; fortunes rise and fall; forgiveness, duty, and faith are tested.\n\nThe novel blends domestic intimacy with historical scope to ask how people find meaning amid upheaval. It suggests that peace is woven from the same threads—mercy, friendship, patience—that war threatens to cut."
  },
  {
    "title": "The Catcher in the Rye",
    "summary": "Holden Caulfield wanders wintertime New York after being expelled from school, delaying his return home while hunting for a conversation that does not feel fake. His sharp, defensive voice masks grief and a fierce tenderness, especially when he thinks of his sister Phoebe or the museum exhibits that never change.\n\nEncounters in bars, lobbies, and classrooms expose loneliness that bravado cannot cover. A protective fantasy takes shape: standing in a rye field, catching children before they fall off a cliff into adulthood.\n\nThe novel captures the ache of being between youth and adulthood, when sincerity feels endangered and kindness rare. Holden’s breakdown reads as a plea for understanding, with connection as the first step back."
  },
  {
    "title": "The Fellowship of the Ring",
    "summary": "When Frodo Baggins inherits a ring of corrupting power, he leaves the Shire with loyal friends to keep it from a dark lord who would enslave Middle-earth. At Rivendell a fellowship forms—hobbits, a wizard, a ranger, an elf, a dwarf, and two men—binding diverse loyalties to a perilous quest.\n\nTheir path runs through snowbound passes, ancient mines, and shadowed forests where the Ring whispers to every weakness. Fellowship is tested by fear and temptation; leadership shifts as wisdom and courage are demanded in different measures.\n\nThe story balances high peril with quiet moments of song, hospitality, and small mercies that prove decisive. By the parting of the ways, the company’s sacrifices have laid the moral ground for the battles to come."
  }
]
